
** agenda
#+begin_src elisp
  (global-set-key "\C-ca" 'org-agenda)

  (setq org-agenda-files '(
                             "~/aamystuff/mystuff/index.org"
                             "~/aamystuff/life/life.org.gpg"
                             "~/aamystuff/phprefactor/phprefactor.org"
                             ))
    (add-hook 'org-agenda-finalize-hook
              (lambda ()
                (save-excursion
                  (goto-char (point-min))
                  (when (re-search-forward
                         "Global list of TODO items of type: [[:upper:]]*" nil t)
                    (insert (propertize
                             (format " (%s remaining)"
                                     (- (count-lines (point-min) (point-max)) 2))
                             'face 'font-lock-comment-face))))))

    (setq org-agenda-sorting-strategy (quote ((todo todo-state-up priority-down))))

    (defun yashi/org-agenda (&optional arg)
      (interactive "P")
      (let ((org-agenda-tag-filter-preset '("-book")))
        (org-agenda arg "t")))

    (setq org-agenda-custom-commands
          '(("w" "Weekly review"
             agenda ""
             ((org-agenda-start-day "-14d")
              (org-agenda-span 14)
              (org-agenda-start-on-weekday 1)
              (org-agenda-start-with-log-mode '(closed))
              (org-agenda-archives-mode t)
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "^\\*\\* DONE "))))
            ("n" "Agenda and all TODOs"
             agenda ""
             ((alltodo "")))
            ))
#+end_src

#+RESULTS:
| w | Weekly review        | agenda |   | ((org-agenda-start-day -14d) (org-agenda-span 14) (org-agenda-start-on-weekday 1) (org-agenda-start-with-log-mode '(closed)) (org-agenda-archives-mode t) (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ^\*\* DONE ))) |
| n | Agenda and all TODOs | agenda |   | ((alltodo ))                                                                                                                                                                                                                             |

